#print(10/3,10//3,10%3)
# 1. 输出print

# str = input()
# 输入input()

# 如果字符串里面有很多字符都需要转义，就需要加很多\，为了简化，Python还允许用r''表示''内部的字符串默认不转义,如:`print(r'\\\t\\')`
# python中的空位none
# 变量名必须是大小写英文、数字和_的组合，且不能用数字开头

print(9/3,10//3,10%3)
# /除法:除法计算结果是浮点数，即使是两个整数恰好整除，结果也是浮点数,如:`9 / 3 -> 3.0`
# //除法,称为地板除，两个整数的除法仍然是整数,如:`10 // 3 -> 3`
# %除法为取余


# `"#!/usr/bin/env python3 # -*- coding: utf-8 -*-"`,第一行注释是为了告诉Linux/OS X系统，这是一个Python可执行程序，
# Windows系统会忽略这个注释.
# 第二行注释是为了告诉Python解释器，按照UTF-8编码读取源代码，否则，你在源代码中写的中文输出可能会有乱码。

